import numpy as np
import pdfplumber


# Обработка PDF-файлов
# Чтение PDF -> извлечение текста, заголовков и структуры.
# Распознавание структуры документа

# Анализ текста для понимания разделов и глав
# Распознавание заголовков на основе форматирования (например, размер шрифта, стиль).
# Добавление TOC

# Моделей ML может быть несколько. К примеру, в зависимости от содержания входного файла.

# Создание оглавления и добавление его в PDF. Фактически создаем новый файл, заполняя его тем, что у нас получилось